'use strict';

console.log("Четвертая задача:");

let dictionary = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'];

let str = prompt('Введите день недели');

let reg = /понедельник|.онедельник|п.недельник|по.едельник|пон.дельник|поне.ельник|понед.льник|понеде.ник|понедел.ник|понедель.ик|понедельн.к|понедельни./i;
let regTwo = /вторник|.торник|в.орник|вт.рник|вто.ник|втор.ик|вторн.к|вторни./i;
let regThree = /среда|.реда|с.еда|ср.да|сре.а|сред./i;
let regFour = /четверг|.етверг|ч.тверг|че.верг|чет.ерг|четв.рг|четве.г|четвер./i;
let regFive = /пятница|.ятница|п.тница|пя.ница|пят.ица|пятн.ца|пятни.а|пятниц./i;
let regSix = /суббота|.уббота|с.ббота|су.бота|суб.ота|субб.та|суббо.а|суббот./i;
let regSeven = /воскресенье|.оскресенье|в.скресенье|во.кресенье|вос.ресенье|воск.есенье|воскр.сенье|воскре.енье|воскрес.нье|воскресе.ье|воскресен.е|воскресень./i;


if (str === '') {
    console.log('Вы ввели пустую строку')
} else {
    if (str.search(reg) === 0) {
        console.log(`Возможно вы имели ввиду ${dictionary[0]}`);
    } else if (str.search(regTwo) === 0) {
        console.log(`Возможно вы имели ввиду ${dictionary[1]}`);
    } else if (str.search(regThree) === 0) {
        console.log(`Возможно вы имели ввиду ${dictionary[2]}`);
    } else if (str.search(regFour) === 0) {
        console.log(`Возможно вы имели ввиду ${dictionary[3]}`);
    } else if (str.search(regFive) === 0) {
        console.log(`Возможно вы имели ввиду ${dictionary[4]}`);
    } else if (str.search(regSix) === 0) {
        console.log(`Возможно вы имели ввиду ${dictionary[5]}`);
    } else if (str.search(regSeven) === 0) {
        console.log(`Возможно вы имели ввиду ${dictionary[6]}`);
    }
}
//----------------------------------------------------------------------------------------------------------------------
console.log('Первая задача:');

let number = '1234';
let sum = +number[0] + +number[1] + +number[2] + +number[3];
console.log(sum);

//----------------------------------------------------------------------------------------------------------------------
console.log('Вторая задача');

let name = prompt('Введите слово'),
    symbol = prompt('Введите символ'),
    arrName = [];

for (let i = 0; i <= name.length; i++) {
    arrName[i] = name[i];
}

for (let i = 0; i <= arrName.length; i++) {
    if (arrName[i] === symbol) {
        arrName.splice(i,1,symbol+symbol);
    }
}

let newName = arrName.join('');
console.log(newName);

//----------------------------------------------------------------------------------------------------------------------
console.log('Третья задача');

let pass = prompt(`Введите пароль. Условия:
                                            - длинна от 9 символов;
                                            - содержит обязательно английские 
                                            буквы верхнего 
                                            и нижнего регистра;
                                            - содержит более двух цифр;
                                            - содержит обязательно один из 
                                            неалфавитных символов 
                                            (например, !, $, #, %).`);

let regExp = /(?=.*[a-z])(?=.*[A-Z])(?=(.*\d){3,})(?=.*[!@#$%^&*])[0-9{3}a-zA-Z!@#$%^&*]{10,}/g;

let result = regExp.test(pass);

if (result) {
    alert('Условия ввода соблюдены');
} else {
    alert('Условия ввода не соблюдены');
}



